[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:44:15
       accessor: "id", // accessor is the "key" in the data
     },
     {
-      Header: "Professor Name",
+      Header: "",
       accessor: "professor.fullName",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Professor Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:53:17
     },
     {
       Header: "Requester Name",
-      accessor: "requester.fullName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-requester.fullName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:76:15
       accessor: "submissionDate",
     },
     {
-      Header: "Last Modified Date",
+      Header: "",
       accessor: "lastModifiedDate",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Modified Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:102:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN")
+    true
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead
