[Killed] ArrayDeclaration
main/components/RequestType/RequestTypeForm.js:10:21
   initialContents,
   submitAction,
   buttonLabel = "Create",
-  requestTypeVals = [],
+  requestTypeVals = ["Stryker was here"],
   professorVals = [],
 }) {
killedBy: RequestTypeForm tests that the initial value of professors and requestTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No request types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrayDeclaration
main/components/RequestType/RequestTypeForm.js:11:19
   submitAction,
   buttonLabel = "Create",
   requestTypeVals = [],
-  professorVals = [],
+  professorVals = ["Stryker was here"],
 }) {
   // Stryker disable all
killedBy: RequestTypeForm tests that the initial value of professors and requestTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/RequestType/RequestTypeForm.js:25:19
   const [requestTypes, setRequestTypes] = useState(requestTypeVals);
 
   //queries endpoint to get list of professors
-  useEffect(() => {
-    const getProfessors = async () => {
-      try {
-        const response = await fetch("/api/admin/users/professors");
-        const data = await response.json();
-        setProfessors(data);
-      } catch (error) {
-        console.error("Error fetching professors");
-      }
-    };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRequestTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
-
-    getProfessors();
-    getRequestTypes();
-  });
+  useEffect(() => {});
 
   const navigate = useNavigate();
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RequestType/RequestTypeForm.js:28:38
   useEffect(() => {
     const getProfessors = async () => {
       try {
-        const response = await fetch("/api/admin/users/professors");
+        const response = await fetch("");
         const data = await response.json();
         setProfessors(data);
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/admin/users/professors"
Received
       1: ""
       2: "/api/requesttypes/all"

Number of calls: 2

[Killed] BlockStatement
main/components/RequestType/RequestTypeForm.js:35:41
         console.error("Error fetching professors");
       }
     };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRequestTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
+    const getRequestTypes = async () => {};
 
     getProfessors();
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/requesttypes/all"
Received
       1: "/api/admin/users/professors"
       2: "/api/admin/users/professors"

Number of calls: 2

[Killed] BlockStatement
main/components/RequestType/RequestTypeForm.js:36:11
       }
     };
     const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRequestTypes(data);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching request types");
       }
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/requesttypes/all"
Received
       1: "/api/admin/users/professors"
       2: "/api/admin/users/professors"

Number of calls: 2

[Killed] StringLiteral
main/components/RequestType/RequestTypeForm.js:37:38
     };
     const getRequestTypes = async () => {
       try {
-        const response = await fetch("/api/requesttypes/all");
+        const response = await fetch("");
         const data = await response.json();
         setRequestTypes(data);
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/requesttypes/all"
Received
       1: "/api/admin/users/professors"
       2: ""

Number of calls: 2

[Killed] BlockStatement
main/components/RequestType/RequestTypeForm.js:40:23
         const response = await fetch("/api/requesttypes/all");
         const data = await response.json();
         setRequestTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
+      } catch (error) {}
     };
 
killedBy: RequestTypeForm tests that the correct error appears when the gets are called for the options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching request types"
Received: "Error fetching professors"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RequestType/RequestTypeForm.js:123:27
               type="string"
               isInvalid={Boolean(errors.requestType)}
               {...register("requestType", {
-                required: "Please select a request type",
+                required: "",
               })}
               defaultValue=""
killedBy: RequestTypeForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a request type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:127:16
               })}
               defaultValue=""
             >
-              {Array.isArray(requestTypes) && requestTypes.length > 0 ? (
+              {true ? (
                 <>
                   <option disabled value="">
killedBy: RequestTypeForm tests that the initial value of professors and requestTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No request types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:127:47
               })}
               defaultValue=""
             >
-              {Array.isArray(requestTypes) && requestTypes.length > 0 ? (
+              {Array.isArray(requestTypes) && true ? (
                 <>
                   <option disabled value="">
killedBy: RequestTypeForm tests that the initial value of professors and requestTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No request types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/RequestType/RequestTypeForm.js:132:37
                   <option disabled value="">
                     Select a request type
                   </option>
-                  {requestTypes.map((requestType) => (
-                    <option
-                      key={requestType.id}
-                      value={requestType.requestType}
-                    >
-                      {requestType.requestType}
-                    </option>
-                  ))}
+                  {requestTypes.map(() => undefined)}
                 </>
               ) : (
killedBy: RequestTypeForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: Recommendations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:148:14
               )}
               <option value="Other">Other</option>
             </Form.Select>
-            {errors.requestType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.requestType.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RequestTypeForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a request type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:148:14
               )}
               <option value="Other">Other</option>
             </Form.Select>
-            {errors.requestType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.requestType.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RequestTypeForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a request type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
