[Killed] ObjectLiteral
src/main/pages/AdminRequestsPage.js:14:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/requests"],
-    { method: "GET", url: "/api/recommendationrequest/admin" },
+    {},
     [],
   );
killedBy: AdminUsersPage tests renders all data properly
statusReason: Error: Unable to find an element with the text: details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
