[Killed] BlockStatement
src/main/pages/StudentProfilePage.js:29:43
     navigate(`/requests/edit/${request.id}`);
   };
 
-  const handleDelete = async (request) => {
-    await fetch(`/api/recommendationrequest?id=${request.id}`, {
-      method: "DELETE",
-    });
-    window.location.reload(); // Simple way to refresh, can be improved with state
-  };
+  const handleDelete = async (request) => {};
 
   return (
killedBy: StudentProfilePage tests checks delete functionality
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/recommendationrequest?id=2", {"method": "DELETE"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/main/pages/StudentProfilePage.js:31:15
 
   const handleDelete = async (request) => {
     await fetch(`/api/recommendationrequest?id=${request.id}`, {
-      method: "DELETE",
+      method: "",
     });
     window.location.reload(); // Simple way to refresh, can be improved with state
killedBy: StudentProfilePage tests checks delete functionality
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/recommendationrequest?id=2",
  Object {
-   "method": "DELETE",
