[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:59:5
   if (
     hasRole(currentUser, "ROLE_USER") &&
     !hasRole(currentUser, "ROLE_ADMIN")
-  ) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
