[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:101:17
     },
     {
       Header: "Due Date",
-      accessor: "dueDate",
+      accessor: "",
       Cell: ({ value }) => {
         const date = new Date(value);
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dueDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
