[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:65:7
 
   const acceptCallback = async (cell) => {
     updateStatusMutation.mutate(
-      { cell, newStatus: "IN PROGRESS" },
+      {},
       {
         onSuccess: () =>
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:65:26
 
   const acceptCallback = async (cell) => {
     updateStatusMutation.mutate(
-      { cell, newStatus: "IN PROGRESS" },
+      { cell, newStatus: "" },
       {
         onSuccess: () =>
killedBy: RecommendationRequestTable update mutation Passes the correct status into the Accept callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"status\":\"IN PROGRESS\"}"
Received: "{\"status\":\"\"}"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:66:7
   const acceptCallback = async (cell) => {
     updateStatusMutation.mutate(
       { cell, newStatus: "IN PROGRESS" },
-      {
-        onSuccess: () =>
-          onUpdateStatusSuccess("Request marked as IN PROGRESS."),
-      },
+      {},
     );
   };
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as IN PROGRESS."
Received: {"message": "Recommendation Request updated"}

Number of calls: 1

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:86:48
     updateStatusMutation.mutate(
       { cell, newStatus: "COMPLETED" },
       {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as COMPLETED."),
+        onSuccess: () => onUpdateStatusSuccess(""),
       },
     );
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as COMPLETED."
Received
       1: {"message": "Recommendation Request updated"}
       2: ""

Number of calls: 2

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:146:5
         return formattedDate(value);
       },
     },
-    {
-      Header: "Due Date",
-      accessor: "dueDate",
-      Cell: ({ value }) => {
-        return formattedDate(value);
-      },
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:165:9
           Deny: denyCallback,
           Complete: completeCallback,
         },
-        "RecommendationRequestTable",
+        "",
       ),
     );
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-2-col-Update-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
