[Timeout] StringLiteral
src/main/components/OurTable.js:116:24
       <Dropdown className="dropdown-cell-wrapper">
         <Dropdown.Toggle
           variant={variant}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-dropdown`}
+          data-testid={``}
         >
           Update

[Killed] ConditionalExpression
src/main/components/OurTable.js:122:12
         </Dropdown.Toggle>
 
         <Dropdown.Menu>
-          {cell.row.original.status === "PENDING" && (
-            <>
-              <Dropdown.Item onClick={() => callback.Accept(cell)}>
-                Accept
-              </Dropdown.Item>
-              <Dropdown.Item onClick={() => callback.Deny(cell)}>
-                Deny
-              </Dropdown.Item>
-            </>
-          )}
+          {false}
 
           {cell.row.original.status === "IN PROGRESS" && (
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: Unable to find an element with the text: Accept. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
src/main/components/OurTable.js:122:12
         </Dropdown.Toggle>
 
         <Dropdown.Menu>
-          {cell.row.original.status === "PENDING" && (
-            <>
-              <Dropdown.Item onClick={() => callback.Accept(cell)}>
-                Accept
-              </Dropdown.Item>
-              <Dropdown.Item onClick={() => callback.Deny(cell)}>
-                Deny
-              </Dropdown.Item>
-            </>
-          )}
+          {cell.row.original.status === "PENDING" || <>
+              <Dropdown.Item onClick={() => callback.Accept(cell)}>
+                Accept
+              </Dropdown.Item>
+              <Dropdown.Item onClick={() => callback.Deny(cell)}>
+                Deny
+              </Dropdown.Item>
+            </>}
 
           {cell.row.original.status === "IN PROGRESS" && (
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: Unable to find an element with the text: Accept. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
src/main/components/OurTable.js:124:39
         <Dropdown.Menu>
           {cell.row.original.status === "PENDING" && (
             <>
-              <Dropdown.Item onClick={() => callback.Accept(cell)}>
+              <Dropdown.Item onClick={() => undefined}>
                 Accept
               </Dropdown.Item>
killedBy: ButtonDropdownColumn tests Clicking accept/deny invokes correct callbacks
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
src/main/components/OurTable.js:127:39
               <Dropdown.Item onClick={() => callback.Accept(cell)}>
                 Accept
               </Dropdown.Item>
-              <Dropdown.Item onClick={() => callback.Deny(cell)}>
+              <Dropdown.Item onClick={() => undefined}>
                 Deny
               </Dropdown.Item>
killedBy: RecommendationRequestTable update mutation Clicking Deny sends PUT with DENIED and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
src/main/components/OurTable.js:133:12
             </>
           )}
 
-          {cell.row.original.status === "IN PROGRESS" && (
+          {cell.row.original.status !== "IN PROGRESS" && (
             <Dropdown.Item onClick={() => callback.Complete(cell)}>
               Complete
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: Unable to find an element with the text: Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
src/main/components/OurTable.js:133:12
             </>
           )}
 
-          {cell.row.original.status === "IN PROGRESS" && (
-            <Dropdown.Item onClick={() => callback.Complete(cell)}>
-              Complete
-            </Dropdown.Item>
-          )}
+          {cell.row.original.status === "IN PROGRESS" || <Dropdown.Item onClick={() => callback.Complete(cell)}>
+              Complete
+            </Dropdown.Item>}
         </Dropdown.Menu>
       </Dropdown>
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: Unable to find an element with the text: Complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
src/main/components/OurTable.js:134:37
           )}
 
           {cell.row.original.status === "IN PROGRESS" && (
-            <Dropdown.Item onClick={() => callback.Complete(cell)}>
+            <Dropdown.Item onClick={() => undefined}>
               Complete
             </Dropdown.Item>
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
