[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:28:11
 
   //queries endpoint to get list of professors
   useEffect(
-    () => {
-      const getProfessors = async () => {
-        try {
-          const response = await fetch("/api/admin/users/professors");
-          const data = await response.json();
-          setProfessors(data);
-        } catch (error) {
-          console.error("Error fetching professors");
-        }
-      };
-      const getRequestTypes = async () => {
-        try {
-          const response = await fetch("/api/requesttypes/all");
-          const data = await response.json();
-          setRecommendationTypes(data);
-        } catch (error) {
-          console.error("Error fetching request types");
-        }
-      };
-
-      getProfessors();
-      getRequestTypes();
-    },
+    () => {},
     // Stryker disable next-line ArrayDeclaration
     [],
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:29:41
   //queries endpoint to get list of professors
   useEffect(
     () => {
-      const getProfessors = async () => {
-        try {
-          const response = await fetch("/api/admin/users/professors");
-          const data = await response.json();
-          setProfessors(data);
-        } catch (error) {
-          console.error("Error fetching professors");
-        }
-      };
+      const getProfessors = async () => {};
       const getRequestTypes = async () => {
         try {
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:35:25
           const data = await response.json();
           setProfessors(data);
         } catch (error) {
-          console.error("Error fetching professors");
+          console.error("");
         }
       };
killedBy: RecommendationRequestForm tests that the correct error appears when the gets are called for the options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching professors"
Received
       1: "Error fetching request types"
       2: ""

Number of calls: 2

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:62:30
 
   // Stryker disable Regex
 
-  const onSubmit = (data) => {
-    // If dueDate is present and only a date (YYYY-MM-DD), append T00:00:00
-    // Stryker disable next-line LogicalOperator,ConditionalExpression
-    if (data.dueDate && /^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
-    }
-    submitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: RecommendationRequestForm tests onSubmit tests calls submitAction with formatted dueDate when dueDate is YYYY-MM-DD
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:65:67
   const onSubmit = (data) => {
     // If dueDate is present and only a date (YYYY-MM-DD), append T00:00:00
     // Stryker disable next-line LogicalOperator,ConditionalExpression
-    if (data.dueDate && /^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
-    }
+    if (data.dueDate && /^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {}
     submitAction(data);
   };
killedBy: RecommendationRequestForm tests onSubmit tests calls submitAction with formatted dueDate when dueDate is YYYY-MM-DD
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"details": "Test details", "dueDate": "2024-12-31T00:00:00", "professor_id": "1", "recommendationType": "CS Department BS/MS program"}
Received: {"details": "Test details", "dueDate": "2024-12-31", "professor_id": "1", "recommendationType": "CS Department BS/MS program"}

Number of calls: 1

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:66:37
     // If dueDate is present and only a date (YYYY-MM-DD), append T00:00:00
     // Stryker disable next-line LogicalOperator,ConditionalExpression
     if (data.dueDate && /^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
+      data.dueDate = data.dueDate + "";
     }
     submitAction(data);
killedBy: RecommendationRequestForm tests onSubmit tests calls submitAction with formatted dueDate when dueDate is YYYY-MM-DD
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"details": "Test details", "dueDate": "2024-12-31T00:00:00", "professor_id": "1", "recommendationType": "CS Department BS/MS program"}
Received: {"details": "Test details", "dueDate": "2024-12-31", "professor_id": "1", "recommendationType": "CS Department BS/MS program"}

Number of calls: 1

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:102:16
               })}
               defaultValue=""
             >
-              {Array.isArray(professors) && professors.length > 0 ? (
+              {Array.isArray(professors) || professors.length > 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:102:45
               })}
               defaultValue=""
             >
-              {Array.isArray(professors) && professors.length > 0 ? (
+              {Array.isArray(professors) && professors.length <= 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: Craig Zzyxx. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:166:14
               )}
               <option value="Other">Other</option>
             </Form.Select>
-            {errors.recommendationType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.recommendationType.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:181:28
               id="details"
               type="text"
               isInvalid={Boolean(errors.details)}
-              {...register("details")}
+              {...register("")}
             />
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:196:51
               id="dueDate"
               type="date"
               isInvalid={Boolean(errors.dueDate)}
-              {...register("dueDate", { required: "Please select a due date" })}
+              {...register("dueDate", { required: "" })}
             />
             {errors.dueDate && (
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a due date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
