[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:48:5
   // Stryker restore all
 
   const updateStatusMutation = useBackendMutation(
-    ({ cell, newStatus }) => cellToAxiosParamsUpdateStatus(cell, newStatus),
+    () => undefined,
     { onSuccess: onUpdateStatusSuccess },
     [apiEndpoint],
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:49:5
 
   const updateStatusMutation = useBackendMutation(
     ({ cell, newStatus }) => cellToAxiosParamsUpdateStatus(cell, newStatus),
-    { onSuccess: onUpdateStatusSuccess },
+    {},
     [apiEndpoint],
   );
killedBy: RecommendationRequestTable update mutation Fires onUpdateStatusSuccess when Accept completes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:59:42
     deleteMutation.mutate(cell);
   };
 
-  const acceptCallback = async (cell) => {
-    updateStatusMutation.mutate(
-      { cell, newStatus: "IN PROGRESS" },
-      {
-        onSuccess: () =>
-          onUpdateStatusSuccess("Request marked as IN PROGRESS."),
-      },
-    );
-  };
+  const acceptCallback = async (cell) => {};
 
   const denyCallback = async (cell) => {
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:63:20
     updateStatusMutation.mutate(
       { cell, newStatus: "IN PROGRESS" },
       {
-        onSuccess: () =>
-          onUpdateStatusSuccess("Request marked as IN PROGRESS."),
+        onSuccess: () => undefined,
       },
     );
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as IN PROGRESS."
Received: {"message": "Recommendation Request updated"}

Number of calls: 1

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:69:40
     );
   };
 
-  const denyCallback = async (cell) => {
-    updateStatusMutation.mutate(
-      { cell, newStatus: "DENIED" },
-      {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as DENIED."),
-      },
-    );
-  };
+  const denyCallback = async (cell) => {};
 
   const completeCallback = async (cell) => {
killedBy: RecommendationRequestTable update mutation Clicking Deny sends PUT with DENIED and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:73:20
     updateStatusMutation.mutate(
       { cell, newStatus: "DENIED" },
       {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as DENIED."),
+        onSuccess: () => undefined,
       },
     );
killedBy: RecommendationRequestTable update mutation Clicking Deny sends PUT with DENIED and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as DENIED."
Received: {"message": "Recommendation Request updated"}

Number of calls: 1

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:78:44
     );
   };
 
-  const completeCallback = async (cell) => {
-    updateStatusMutation.mutate(
-      { cell, newStatus: "COMPLETED" },
-      {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as COMPLETED."),
-      },
-    );
-  };
+  const completeCallback = async (cell) => {};
 
   const columns = [
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:82:20
     updateStatusMutation.mutate(
       { cell, newStatus: "COMPLETED" },
       {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as COMPLETED."),
+        onSuccess: () => undefined,
       },
     );
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as COMPLETED."
Received: {"message": "Recommendation Request updated"}

Number of calls: 1

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:97:15
       accessor: "professor.fullName",
     },
     {
-      Header: "Professor Email",
+      Header: "",
       accessor: "professor.email",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Professor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:100:5
       Header: "Professor Email",
       accessor: "professor.email",
     },
-    {
-      Header: "Requester Name",
-      accessor: "requester.fullName",
-    },
+    {},
     {
       Header: "Requester Email",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:105:15
       accessor: "requester.fullName",
     },
     {
-      Header: "Requester Email",
+      Header: "",
       accessor: "requester.email",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requester Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:108:5
       Header: "Requester Email",
       accessor: "requester.email",
     },
-    {
-      Header: "Recommendation Type",
-      accessor: "recommendationType",
-    },
+    {},
     {
       Header: "Details",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:118:17
     },
     {
       Header: "Status",
-      accessor: "status",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:123:28
     {
       Header: "Submission Date",
       accessor: "submissionDate",
-      Cell: ({ value }) => {
-        return formattedDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 02:00
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:130:28
     {
       Header: "Last Modified Date",
       accessor: "lastModifiedDate",
-      Cell: ({ value }) => {
-        return formattedDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  02/02/2022 02:00
Received:

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:134:5
         return formattedDate(value);
       },
     },
-    {
-      Header: "Completion Date",
-      accessor: "completionDate",
-      Cell: ({ value }) => {
-        if (!value) return ""; // Check if value exists
-        return formattedDate(value);
-      },
-    },
+    {},
     {
       Header: "Due Date",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:137:28
     {
       Header: "Completion Date",
       accessor: "completionDate",
-      Cell: ({ value }) => {
-        if (!value) return ""; // Check if value exists
-        return formattedDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  06/02/2022 02:00
Received:

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:138:13
       Header: "Completion Date",
       accessor: "completionDate",
       Cell: ({ value }) => {
-        if (!value) return ""; // Check if value exists
+        if (true) return ""; // Check if value exists
         return formattedDate(value);
       },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  06/02/2022 02:00
Received:

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:138:13
       Header: "Completion Date",
       accessor: "completionDate",
       Cell: ({ value }) => {
-        if (!value) return ""; // Check if value exists
+        if (value) return ""; // Check if value exists
         return formattedDate(value);
       },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  06/02/2022 02:00
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:145:28
     {
       Header: "Due Date",
       accessor: "dueDate",
-      Cell: ({ value }) => {
-        return formattedDate(value);
-      },
+      Cell: ({ value }) => {},
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  09/02/2022 02:00
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:151:64
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR") && isPendingPage) {
-    columns.push(
-      ButtonDropdownColumn(
-        "Update",
-        "info",
-        {
-          Accept: acceptCallback,
-          Deny: denyCallback,
-          Complete: completeCallback,
-        },
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_PROFESSOR") && isPendingPage) {}
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-2-col-Update-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:151:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR") && isPendingPage) {
+  if (hasRole(currentUser, "ROLE_PROFESSOR") || isPendingPage) {
     columns.push(
       ButtonDropdownColumn(
killedBy: RecommendationRequestTable update mutation Update button not render for a non-professor even on the pending page
statusReason: Error: expect(received).toBeNull()

Received: <button aria-expanded="false" class="dropdown-toggle btn btn-info" data-testid="RecommendationRequestTable-cell-row-0-col-Update-dropdown" id="react-aria-:ro:" type="button">Update</button>

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:167:7
   }
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (false) {
     columns.push(
       ButtonColumn(
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:167:7
   }
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (true) {
     columns.push(
       ButtonColumn(
killedBy: UserTable tests A user with no roles has expected content
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="RecommendationRequestTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:179:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
-    !isPendingPage &&
-    !isCompletedPage
+    hasRole(currentUser, "ROLE_USER") && !hasRole(currentUser, "ROLE_ADMIN") && !isPendingPage || !isCompletedPage
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:179:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
-    !isPendingPage &&
+    hasRole(currentUser, "ROLE_USER") && !hasRole(currentUser, "ROLE_ADMIN") || !isPendingPage &&
     !isCompletedPage
   ) {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:180:5
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
+    hasRole(currentUser, "ROLE_ADMIN") &&
     !isPendingPage &&
     !isCompletedPage
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:180:27
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
+    !hasRole(currentUser, "") &&
     !isPendingPage &&
     !isCompletedPage
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:181:5
   if (
     hasRole(currentUser, "ROLE_USER") &&
     !hasRole(currentUser, "ROLE_ADMIN") &&
-    !isPendingPage &&
+    isPendingPage &&
     !isCompletedPage
   ) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:182:5
     hasRole(currentUser, "ROLE_USER") &&
     !hasRole(currentUser, "ROLE_ADMIN") &&
     !isPendingPage &&
-    !isCompletedPage
+    isCompletedPage
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:183:5
     !hasRole(currentUser, "ROLE_ADMIN") &&
     !isPendingPage &&
     !isCompletedPage
-  ) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
