[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:23:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RequestTypeForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
       </Row>
 
killedBy: RequestTypeForm tests renders correctly with initialContents
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:23:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RequestTypeForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: RequestTypeForm tests renders correctly with initialContents
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RequestType/RequestTypeForm.js:49:43
               id="requestType"
               type="text"
               isInvalid={Boolean(errors.requestType)}
-              {...register("requestType", {
-                required: true,
-              })}
+              {...register("requestType", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RequestTypeForm tests shows validation error on missing input
statusReason: Error: Unable to find an element with the text: requestType is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RequestType/RequestTypeForm.js:50:27
               type="text"
               isInvalid={Boolean(errors.requestType)}
               {...register("requestType", {
-                required: true,
+                required: false,
               })}
             />
killedBy: RequestTypeForm tests shows validation error on missing input
statusReason: Error: Unable to find an element with the text: requestType is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RequestType/RequestTypeForm.js:54:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestType && "requestType is required."}
+              {errors.requestType || "requestType is required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RequestTypeForm tests does NOT show validation error when requestType is provided
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">requestType is required.</div> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeForm.js:54:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestType && "requestType is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RequestTypeForm tests shows validation error on missing input
statusReason: Error: Unable to find an element with the text: requestType is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
