[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:15:34
 export default function RequestTypeTable({ requestTypes, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/requesttypes/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for professorUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requesttypes/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:39:17
     },
     {
       Header: "Request Type",
-      accessor: "requestType",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-requestType"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:45:5
 
   // only professors can delete / edit
   if (
-    hasRole(currentUser, "ROLE_PROFESSOR") ||
-    hasRole(currentUser, "ROLE_ADMIN")
+    true
   ) {
     columns.push(
killedBy: UserTable tests A user with no roles has expected content
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="RequestTypeTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:45:5
 
   // only professors can delete / edit
   if (
-    hasRole(currentUser, "ROLE_PROFESSOR") ||
-    hasRole(currentUser, "ROLE_ADMIN")
+    false
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:47:5
   if (
     hasRole(currentUser, "ROLE_PROFESSOR") ||
     hasRole(currentUser, "ROLE_ADMIN")
-  ) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   if (
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:49:56
     hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:55:26
 
   if (
     hasRole(currentUser, "ROLE_PROFESSOR") ||
-    hasRole(currentUser, "ROLE_ADMIN")
+    hasRole(currentUser, "")
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:56:5
   if (
     hasRole(currentUser, "ROLE_PROFESSOR") ||
     hasRole(currentUser, "ROLE_ADMIN")
-  ) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:58:53
     hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:58:28
     hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
+      ButtonColumn("Edit", "", editCallback, "RequestTypeTable"),
     );
   }
killedBy: UserTable tests Has the expected column headers and content for professorUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
