[Killed] BlockStatement
src/main/pages/AdminRequestsPage.js:5:33
 import RecommendationRequestTable from "main/components/RecommendationRequest/RecommendationRequestTable";
 
 import { useBackend } from "main/utils/useBackend";
-const AdminRequestsPage = () => {
-  const {
-    data: requests,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/admin/requests"],
-    { method: "GET", url: "/api/recommendationrequest/admin" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>Recommendation Requests</h2>
-      <RecommendationRequestTable requests={requests} />
-    </BasicLayout>
-  );
-};
+const AdminRequestsPage = () => {};
 
 export default AdminRequestsPage;
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Unable to find an element with the text: Recommendation Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrayDeclaration
src/main/pages/AdminRequestsPage.js:14:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/requests"],
     { method: "GET", url: "/api/recommendationrequest/admin" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: AdminUsersPage tests empty initial table to test empty array
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-id" role="cell" /> instead
