[Killed] OptionalChaining
src/main/pages/HomePage.js:18:10
           requests. The system tracks request status, deadlines, and provides
           statistics on recommendation activities.
         </p>
-        {currentUser?.loggedIn ? (
+        {currentUser.loggedIn ? (
           <p>
             Use the navigation bar above to access pending requests, completed
killedBy: HomePage tests renders correctly when user is logged out
statusReason: TypeError: Cannot read properties of undefined (reading 'loggedIn')
