[Killed] BooleanLiteral
main/pages/RequestType/RequestTypeCreatePage.js:7:61
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RequestTypeCreatePage({ storybook = false }) {
+export default function RequestTypeCreatePage({ storybook = true }) {
   const objectToAxiosParams = (requestTypes) => ({
     url: "/api/requesttypes/post",
killedBy: RequestTypeCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/requesttypes/all"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/RequestType/RequestTypeCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RequestTypeCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (requestTypes) => ({
-    url: "/api/requesttypes/post",
-    method: "POST",
-    params: {
-      id: requestTypes.id,
-      requestType: requestTypes.requestType,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (requestTypes) => {
killedBy: RequestTypeCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestType/RequestTypeCreatePage.js:10:13
 export default function RequestTypeCreatePage({ storybook = false }) {
   const objectToAxiosParams = (requestTypes) => ({
     url: "/api/requesttypes/post",
-    method: "POST",
+    method: "",
     params: {
       id: requestTypes.id,
killedBy: RequestTypeCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RequestType/RequestTypeCreatePage.js:17:39
     },
   });
 
-  const onSuccess = (requestTypes) => {
-    toast(
-      `New requestType Created - id: ${requestTypes.id} request type: ${requestTypes.requestType}`,
-    );
-  };
+  const onSuccess = (requestTypes) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestTypeCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New requestType Created - id: 17 request type: Inqueries"

Number of calls: 0
