[Killed] BooleanLiteral
main/pages/RequestType/RequestTypeEditPage.js:8:59
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RequestTypeEditPage({ storybook = false }) {
+export default function RequestTypeEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/requesttypes/all"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/requesttypes?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/requesttypes`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: RequestTypeEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-requestType"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/RequestType/RequestTypeEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (requestTypes) => ({
-    url: "/api/requesttypes",
-    method: "PUT",
-    params: {
-      id: requestTypes.id,
-    },
-    data: {
-      requestType: requestTypes.requestType,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (requestTypes) => {
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RequestType Updated - id: 17 request type: Regrades"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:31:13
   const objectToAxiosPutParams = (requestTypes) => ({
     url: "/api/requesttypes",
     method: "PUT",
-    params: {
-      id: requestTypes.id,
-    },
+    params: {},
     data: {
       requestType: requestTypes.requestType,
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:34:11
     params: {
       id: requestTypes.id,
     },
-    data: {
-      requestType: requestTypes.requestType,
-    },
+    data: {},
   });
 
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requestType\":\"Regrades\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/RequestType/RequestTypeEditPage.js:39:39
     },
   });
 
-  const onSuccess = (requestTypes) => {
-    toast(
-      `RequestType Updated - id: ${requestTypes.id} request type: ${requestTypes.requestType}`,
-    );
-  };
+  const onSuccess = (requestTypes) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestType/RequestTypeEditPage.js:41:7
 
   const onSuccess = (requestTypes) => {
     toast(
-      `RequestType Updated - id: ${requestTypes.id} request type: ${requestTypes.requestType}`,
+      ``,
     );
   };
killedBy: RequestTypeEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RequestType Updated - id: 17 request type: Regrades"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/RequestType/RequestTypeEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RequestType</h1>
-        {requestTypes && (
-          <RequestTypeForm
-            initialContents={requestTypes}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RequestTypeEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-requestType"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RequestType/RequestTypeEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RequestType</h1>
-        {requestTypes && (
-          <RequestTypeForm
-            initialContents={requestTypes}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RequestTypeEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-requestType"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
