[Killed] BlockStatement
main/pages/RequestType/RequestTypeIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (
-      hasRole(currentUser, "ROLE_PROFESSOR") ||
-      hasRole(currentUser, "ROLE_ADMIN")
-    ) {
-      return (
-        <Button
-          variant="primary"
-          href="/requesttypes/post"
-          style={{ float: "right" }}
-        >
-          Create RequestType
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RequestTypeIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create RequestType/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RequestType/RequestTypeIndexPage.js:28:7
     if (
       hasRole(currentUser, "ROLE_PROFESSOR") ||
       hasRole(currentUser, "ROLE_ADMIN")
-    ) {
-      return (
-        <Button
-          variant="primary"
-          href="/requesttypes/post"
-          style={{ float: "right" }}
-        >
-          Create RequestType
-        </Button>
-      );
-    }
+    ) {}
   };
 
killedBy: RequestTypeIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create RequestType/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
