[Killed] StringLiteral
main/pages/Requests/CompletedRequestsPage.js:9:44
 export default function CompletedRequestsPage() {
   const { data: currentUser } = useCurrentUser();
 
-  const apiEndpoint = hasRole(currentUser, "ROLE_PROFESSOR")
+  const apiEndpoint = hasRole(currentUser, "")
     ? "/api/recommendationrequest/professor/all"
     : "/api/recommendationrequest/requester/all";
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Requests/CompletedRequestsPage.js:20:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [apiEndpoint],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: apiEndpoint,
-    },
+    {},
     // Stryker disable next-line all : it's hard to test GET requests that are still in progress
     [],
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/Requests/CompletedRequestsPage.js:29:29
     [],
   );
 
-  const completedRequests = requests.filter(
-    (request) => request.status === "COMPLETED" || request.status === "DENIED",
-  );
+  const completedRequests = requests;
 
   return (
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
main/pages/Requests/CompletedRequestsPage.js:30:18
   );
 
   const completedRequests = requests.filter(
-    (request) => request.status === "COMPLETED" || request.status === "DENIED",
+    (request) => false,
   );
 
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Requests/CompletedRequestsPage.js:30:18
   );
 
   const completedRequests = requests.filter(
-    (request) => request.status === "COMPLETED" || request.status === "DENIED",
+    (request) => false || request.status === "DENIED",
   );
 
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false
