[Killed] StringLiteral
main/pages/Requests/PendingRequestsPage.js:10:7
   const { data: currentUser } = useCurrentUser();
 
   const apiEndpoint = hasRole(currentUser, "ROLE_PROFESSOR")
-    ? "/api/recommendationrequest/professor/all"
+    ? ""
     : "/api/recommendationrequest/requester/all";
 
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/Requests/PendingRequestsPage.js:29:27
     [],
   );
 
-  const pendingRequests = requests.filter(
-    (request) =>
-      request.status === "PENDING" || request.status === "IN PROGRESS",
-  );
+  const pendingRequests = requests;
 
   return (
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
main/pages/Requests/PendingRequestsPage.js:30:5
   );
 
   const pendingRequests = requests.filter(
-    (request) =>
-      request.status === "PENDING" || request.status === "IN PROGRESS",
+    () => undefined,
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Requests/PendingRequestsPage.js:31:39
 
   const pendingRequests = requests.filter(
     (request) =>
-      request.status === "PENDING" || request.status === "IN PROGRESS",
+      request.status === "PENDING" || request.status !== "IN PROGRESS",
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:31:39
 
   const pendingRequests = requests.filter(
     (request) =>
-      request.status === "PENDING" || request.status === "IN PROGRESS",
+      request.status === "PENDING" || false,
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false
