[Killed] ArrowFunction
main/pages/Requests/RecommendationRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      professorId: recommendationRequest.professor_id,
-      recommendationType: recommendationRequest.recommendationType,
-      details: recommendationRequest.details,
-      dueDate: recommendationRequest.dueDate,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Requests/RecommendationRequestCreatePage.js:11:13
   const objectToAxiosParams = (recommendationRequest) => ({
     url: "/api/recommendationrequest/post",
     method: "POST",
-    params: {
-      professorId: recommendationRequest.professor_id,
-      recommendationType: recommendationRequest.recommendationType,
-      details: recommendationRequest.details,
-      dueDate: recommendationRequest.dueDate,
-    },
+    params: {},
   });
 
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /profile
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "details": "new details",
-   "dueDate": "2222-11-11T00:00:00",

[Killed] StringLiteral
main/pages/Requests/RecommendationRequestCreatePage.js:21:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New recommendationRequest Created - id: 7"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Requests/RecommendationRequestCreatePage.js:38:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/profile" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/profile"}

Number of calls: 0
