[Killed] ArrowFunction
main/pages/Requests/RecommendationRequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      professorId: recommendationRequest.professor_id,
-      recommendationType: recommendationRequest.recommendationType,
-      details: recommendationRequest.details,
-      dueDate: recommendationRequest.dueDate,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally renders, allows editing, and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] LogicalOperator
main/pages/Requests/RecommendationRequestEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationRequest,
-              professor_id: recommendationRequest.professor?.id,
-              dueDate: recommendationRequest.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {recommendationRequest || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={{
+  ...recommendationRequest,
+  professor_id: recommendationRequest.professor?.id,
+  dueDate: recommendationRequest.dueDate.substring(0, 10)
+}} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: TypeError: Cannot read properties of undefined (reading 'professor')

[Killed] ConditionalExpression
main/pages/Requests/RecommendationRequestEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationRequest,
-              professor_id: recommendationRequest.professor?.id,
-              dueDate: recommendationRequest.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally renders, allows editing, and submits updated data
statusReason: Error: Unable to find a label with the text of: Professor

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Requests/RecommendationRequestEditPage.js:73:29
             buttonLabel={"Update"}
             initialContents={{
               ...recommendationRequest,
-              professor_id: recommendationRequest.professor?.id,
+              professor_id: recommendationRequest.professor.id,
               dueDate: recommendationRequest.dueDate.substring(0, 10),
             }}
killedBy: RecommendationRequestEditPage tests tests where backend is working normally handles missing professor in initial data
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
main/pages/Requests/RecommendationRequestEditPage.js:74:24
             initialContents={{
               ...recommendationRequest,
               professor_id: recommendationRequest.professor?.id,
-              dueDate: recommendationRequest.dueDate.substring(0, 10),
+              dueDate: recommendationRequest.dueDate,
             }}
           />
killedBy: RecommendationRequestEditPage tests tests where backend is working normally renders, allows editing, and submits updated data
statusReason: Error: expect(element).toHaveValue(2025-01-15)

Expected the element to have value:
  2025-01-15
Received:


Ignored nodes: comments, script, style
