[Killed] BlockStatement
main/pages/Requests/StatisticsPage.js:3:42
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function StatisticsPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Statistics page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function StatisticsPage() {}
 
killedBy: StatisticsPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Statistics page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
