[Killed] ArrayDeclaration
src/main/pages/StudentProfilePage.js:16:5
   const { data: requests } = useBackend(
     ["/api/recommendationrequest/requester/all"],
     { method: "GET", url: "/api/recommendationrequest/requester/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: StudentProfilePage tests useBackend is called with the correct parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
src/main/pages/StudentProfilePage.js:25:35
 
   const { email, pictureUrl, fullName } = currentUser.root.user;
 
-  const handleEdit = (request) => {
-    navigate(`/requests/edit/${request.id}`);
-  };
+  const handleEdit = (request) => {};
 
   return (
killedBy: StudentProfilePage tests renders request data and checks edit functionality
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requests/edit/1"

Number of calls: 0

[Killed] ArrowFunction
src/main/pages/StudentProfilePage.js:48:22
         <Col>
           <Button
             variant="primary"
-            onClick={() => navigate("/requests/create")}
+            onClick={() => undefined}
           >
             Create New Request
killedBy: StudentProfilePage tests checks create new request button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requests/create"

Number of calls: 0
