[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export const formattedDate = (val) => {
killedBy: UserTable tests Delete button calls delete callback (for user)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/recommendationrequest",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:24:48
   return formattedDate;
 };
 
-export function onUpdateStatusSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onUpdateStatusSuccess(message) {}
 
 export function cellToAxiosParamsUpdateStatus(cell, newStatus) {
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as IN PROGRESS."

Number of calls: 0

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:29:64
   toast(message);
 }
 
-export function cellToAxiosParamsUpdateStatus(cell, newStatus) {
-  return {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-    },
-  };
-}
+export function cellToAxiosParamsUpdateStatus(cell, newStatus) {}
 
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:31:10
 
 export function cellToAxiosParamsUpdateStatus(cell, newStatus) {
   return {
-    url: "/api/recommendationrequest/professor",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as IN PROGRESS."
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
